package pkg1;

public class Main {

	public static void main(String[] args) {
		
		/* 7월 24일(월) ~ 7월 30일(일) 회고록
		 * 
		 * 26일 수요일에 튀르키예에서 돌아온 후,
		 * 자바 알고리즘 문제 10문제씩 풀었다.
		 * 
		 * 여행을 갔다온 탓일까... 까먹은 느낌이 없잖아 있었다.
		 * '이렇게 공부를 잠깐 안해도 사람이 까먹는구나' 라는 생각과 함께
		 * 앞으로는 여행 가서도 책이나 노트북은 들고 가야겠다라는 생각이 들었다.
		 * 
		 * 그래도 10문제씩 푸니까 다시 감각은 돌아왔다.
		 * 빨리 취업해서 일 하고 싶다~! 물론 일 시작하면 쉬고 싶다!라고 생각할 수 있겠지만
		 * 나는 그렇지 않다. 사회에 보탬이 되고 싶고 제대로 효도하고 싶다.
		 * 
		 * 누군가 나에게 기회를 준다면 참 좋겠다.
		 * 누구보다 열심히 스마트하게 할 자신 있는데...
		 * 
		 * 뭐 이런 고민한다고 해도 바뀔 건 없으니, 그냥 지금 하던 문제나 열심히 풀어야겠다.
		 * 8월 1일부터는 SQLD 시험 대비 진도 나갈 예정이다.
		 * 그때까지는 알고리즘 문제 쭈-욱 풀어볼 예정이다.
		 * 
		 * 오늘 일요일. 최정원 화이팅하자!
		 * 
		 */
	}

}
